espressif/esp-idf/components/soc/esp32c5/register/soc/cache_struct.h
/**
 * SPDX-FileCopyrightText: 2025-2026 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: Control and configuration registers */
/** Type of l1_icache_ctrl register
 *  L1 instruction Cache(L1-ICache) control register
 */
typedef union {
    struct {
        uint32_t reserved_0:2;
        /** l1_icache_shut_ibus2 : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache_shut_ibus2:1;
        /** l1_icache_shut_ibus3 : R/W; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache_shut_ibus3:1;
        uint32_t reserved_4:4;
        /** l1_icache_undef_op : R/W; bitpos: [15:8]; default: 0;
         *  Internal debug control field.
         *  bits[1:0]: Arbitration mode.
         *    0: Round-robin, hold bus until data fetch completes.
         *    1: Round-robin, release bus after request is issued.
         *    2/3: Random arbitration.
         *  bit[5]: 1: Disable auto clock gating.
         */
        uint32_t l1_icache_undef_op:8;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} cache_l1_icache_ctrl_reg_t;

/** Type of l1_cache_ctrl register
 *  L1 data Cache(L1-Cache) control register
 */
typedef union {
    struct {
        /** l1_cache_shut_bus0 : R/W; bitpos: [0]; default: 0;
         *  The bit is used to disable core0 bus0 access L1-Cache, 0: enable, 1: disable
         */
        uint32_t l1_cache_shut_bus0:1;
        /** l1_cache_shut_bus1 : R/W; bitpos: [1]; default: 0;
         *  The bit is used to disable core0 bus1 access L1-Cache, 0: enable, 1: disable
         */
        uint32_t l1_cache_shut_bus1:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} cache_l1_cache_ctrl_reg_t;


/** Group: Cache Mode Control and configuration registers */
/** Type of l1_icache_cachesize_conf register
 *  L1 instruction Cache CacheSize mode configure register
 */
typedef union {
    struct {
        uint32_t reserved_0:4;
        /** l1_icache_cachesize_4k : HRO; bitpos: [4]; default: 1;
         *  The field is used to configure cachesize of L1-ICache as 4k bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l1_icache_cachesize_4k:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} cache_l1_icache_cachesize_conf_reg_t;

/** Type of l1_icache_blocksize_conf register
 *  L1 instruction Cache BlockSize mode configure register
 */
typedef union {
    struct {
        uint32_t reserved_0:3;
        /** l1_icache_blocksize_64 : HRO; bitpos: [3]; default: 1;
         *  The field is used to configureblocksize of L1-ICache as 64 bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l1_icache_blocksize_64:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} cache_l1_icache_blocksize_conf_reg_t;

/** Type of l1_cache_cachesize_conf register
 *  L1 data Cache CacheSize mode configure register
 */
typedef union {
    struct {
        uint32_t reserved_0:7;
        /** l1_dcache_cachesize_32k : HRO; bitpos: [7]; default: 1;
         *  The field is used to configure cachesize of L1-DCache as 32k bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l1_dcache_cachesize_32k:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} cache_l1_cache_cachesize_conf_reg_t;

/** Type of l1_cache_blocksize_conf register
 *  L1 data Cache BlockSize mode configure register
 */
typedef union {
    struct {
        uint32_t reserved_0:2;
        /** l1_cache_blocksize_32 : HRO; bitpos: [2]; default: 1;
         *  The field is used to configureblocksize of L1-DCache as 32 bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l1_cache_blocksize_32:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} cache_l1_cache_blocksize_conf_reg_t;


/** Group: Wrap Mode Control and configuration registers */
/** Type of l1_cache_wrap_around_ctrl register
 *  Cache wrap around control register
 */
typedef union {
    struct {
        uint32_t reserved_0:2;
        /** l1_icache2_wrap : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_wrap:1;
        uint32_t reserved_3:1;
        /** l1_cache_wrap : R/W; bitpos: [4]; default: 0;
         *  Set this bit as 1 to enable L1-DCache wrap around mode.
         */
        uint32_t l1_cache_wrap:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} cache_l1_cache_wrap_around_ctrl_reg_t;


/** Group: Early Restart Control registers */
/** Type of l1_cache_miss_access_ctrl register
 *  Cache wrap around control register
 */
typedef union {
    struct {
        uint32_t reserved_0:2;
        /** l1_icache2_miss_disable_access : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_miss_disable_access:1;
        uint32_t reserved_3:1;
        /** l1_cache_miss_disable_access : R/W; bitpos: [4]; default: 0;
         *  Set this bit as 1 to disable early restart of L1-DCache
         */
        uint32_t l1_cache_miss_disable_access:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} cache_l1_cache_miss_access_ctrl_reg_t;


/** Group: Cache Freeze Control registers */
/** Type of l1_cache_freeze_ctrl register
 *  Cache Freeze control register
 */
typedef union {
    struct {
        uint32_t reserved_0:8;
        /** l1_icache2_freeze_en : R/W; bitpos: [8]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_freeze_en:1;
        /** l1_icache2_freeze_mode : R/W; bitpos: [9]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_freeze_mode:1;
        uint32_t reserved_10:6;
        /** l1_cache_freeze_en : R/W; bitpos: [16]; default: 0;
         *  The bit is used to enable freeze operation on L1-Cache. It can be cleared by
         *  software.
         */
        uint32_t l1_cache_freeze_en:1;
        /** l1_cache_freeze_mode : R/W; bitpos: [17]; default: 0;
         *  The bit is used to configure mode of freeze operation L1-Cache. 0: a miss-access
         *  will not stuck. 1: a miss-access will stuck.
         */
        uint32_t l1_cache_freeze_mode:1;
        /** l1_cache_freeze_done : RO; bitpos: [18]; default: 0;
         *  The bit is used to indicate whether freeze operation on L1-Cache is finished or
         *  not. 0: not finished. 1: finished.
         */
        uint32_t l1_cache_freeze_done:1;
        uint32_t reserved_19:13;
    };
    uint32_t val;
} cache_l1_cache_freeze_ctrl_reg_t;


/** Group: Cache Data Memory Access Control and Configuration registers */
/** Type of l1_cache_data_mem_acs_conf register
 *  Cache data memory access configure register
 */
typedef union {
    struct {
        uint32_t reserved_0:8;
        /** l1_icache2_data_mem_rd_en : R/W; bitpos: [8]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_data_mem_rd_en:1;
        /** l1_icache2_data_mem_wr_en : R/W; bitpos: [9]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_data_mem_wr_en:1;
        uint32_t reserved_10:6;
        /** l1_cache_data_mem_rd_en : R/W; bitpos: [16]; default: 0;
         *  The bit is used to enable config-bus read L1-Cache data memoryory. 0: disable, 1:
         *  enable.
         */
        uint32_t l1_cache_data_mem_rd_en:1;
        /** l1_cache_data_mem_wr_en : R/W; bitpos: [17]; default: 0;
         *  The bit is used to enable config-bus write L1-Cache data memoryory. 0: disable, 1:
         *  enable.
         */
        uint32_t l1_cache_data_mem_wr_en:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} cache_l1_cache_data_mem_acs_conf_reg_t;


/** Group: Cache Tag Memory Access Control and Configuration registers */
/** Type of l1_cache_tag_mem_acs_conf register
 *  Cache tag memory access configure register
 */
typedef union {
    struct {
        uint32_t reserved_0:8;
        /** l1_icache2_tag_mem_rd_en : R/W; bitpos: [8]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_tag_mem_rd_en:1;
        /** l1_icache2_tag_mem_wr_en : R/W; bitpos: [9]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_tag_mem_wr_en:1;
        uint32_t reserved_10:6;
        /** l1_cache_tag_mem_rd_en : R/W; bitpos: [16]; default: 0;
         *  The bit is used to enable config-bus read L1-Cache tag memoryory. 0: disable, 1:
         *  enable.
         */
        uint32_t l1_cache_tag_mem_rd_en:1;
        /** l1_cache_tag_mem_wr_en : R/W; bitpos: [17]; default: 0;
         *  The bit is used to enable config-bus write L1-Cache tag memoryory. 0: disable, 1:
         *  enable.
         */
        uint32_t l1_cache_tag_mem_wr_en:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} cache_l1_cache_tag_mem_acs_conf_reg_t;


/** Group: Prelock Control and configuration registers */
/** Type of l1_icache2_prelock_conf register
 *  L1 instruction Cache 2 prelock configure register
 */
typedef union {
    struct {
        /** l1_icache2_prelock_sct0_en : R/W; bitpos: [0]; default: 0;
         *  The bit is used to enable the first section of prelock function on L1-ICache2.
         */
        uint32_t l1_icache2_prelock_sct0_en:1;
        /** l1_icache2_prelock_sct1_en : R/W; bitpos: [1]; default: 0;
         *  The bit is used to enable the second section of prelock function on L1-ICache2.
         */
        uint32_t l1_icache2_prelock_sct1_en:1;
        /** l1_icache2_prelock_rgid : R/W; bitpos: [5:2]; default: 0;
         *  The bit is used to set  the gid of l1 icache2 prelock.
         */
        uint32_t l1_icache2_prelock_rgid:4;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} cache_l1_icache2_prelock_conf_reg_t;

/** Type of l1_icache2_prelock_sct0_addr register
 *  L1 instruction Cache 2 prelock section0 address configure register
 */
typedef union {
    struct {
        /** l1_icache2_prelock_sct0_addr : R/W; bitpos: [31:0]; default: 0;
         *  Those bits are used to configure the start address of the first section of prelock
         *  on L1-ICache2, which should be used together with L1_ICACHE2_PRELOCK_SCT0_SIZE_REG
         */
        uint32_t l1_icache2_prelock_sct0_addr:32;
    };
    uint32_t val;
} cache_l1_icache2_prelock_sct0_addr_reg_t;

/** Type of l1_icache2_prelock_sct1_addr register
 *  L1 instruction Cache 2 prelock section1 address configure register
 */
typedef union {
    struct {
        /** l1_icache2_prelock_sct1_addr : R/W; bitpos: [31:0]; default: 0;
         *  Those bits are used to configure the start address of the second section of prelock
         *  on L1-ICache2, which should be used together with L1_ICACHE2_PRELOCK_SCT1_SIZE_REG
         */
        uint32_t l1_icache2_prelock_sct1_addr:32;
    };
    uint32_t val;
} cache_l1_icache2_prelock_sct1_addr_reg_t;

