espressif/esp-idf/components/soc/esp32c5/register/soc/cache_struct.h
/** Type of l1_cache_acs_fail_int_clr register
 *  L1-Cache Access Fail Interrupt clear register
 */
typedef union {
    struct {
        uint32_t reserved_0:2;
        /** l1_icache2_fail_int_clr : WT; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_fail_int_clr:1;
        uint32_t reserved_3:1;
        /** l1_cache_fail_int_clr : WT; bitpos: [4]; default: 0;
         *  The bit is used to clear interrupt of access fail that occurs in L1-DCache due to
         *  cpu accesses L1-DCache.
         */
        uint32_t l1_cache_fail_int_clr:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} cache_l1_cache_acs_fail_int_clr_reg_t;

/** Type of l1_cache_acs_fail_int_raw register
 *  Cache Access Fail Interrupt raw register
 */
typedef union {
    struct {
        uint32_t reserved_0:2;
        /** l1_icache2_fail_int_raw : R/WTC/SS; bitpos: [2]; default: 0;
         *  The raw bit of the interrupt of access fail that occurs in L1-ICache2.
         */
        uint32_t l1_icache2_fail_int_raw:1;
        uint32_t reserved_3:1;
        /** l1_cache_fail_int_raw : R/WTC/SS; bitpos: [4]; default: 0;
         *  The raw bit of the interrupt of access fail that occurs in L1-DCache.
         */
        uint32_t l1_cache_fail_int_raw:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} cache_l1_cache_acs_fail_int_raw_reg_t;

/** Type of l1_cache_acs_fail_int_st register
 *  Cache Access Fail Interrupt status register
 */
typedef union {
    struct {
        uint32_t reserved_0:2;
        /** l1_icache2_fail_int_st : RO; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_fail_int_st:1;
        uint32_t reserved_3:1;
        /** l1_cache_fail_int_st : RO; bitpos: [4]; default: 0;
         *  The bit indicates the interrupt status of access fail that occurs in L1-DCache due
         *  to cpu accesses L1-DCache.
         */
        uint32_t l1_cache_fail_int_st:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} cache_l1_cache_acs_fail_int_st_reg_t;

/** Type of l1_cache_sync_preload_int_ena register
 *  L1-Cache Access Fail Interrupt enable register
 */
typedef union {
    struct {
        uint32_t reserved_0:2;
        /** l1_icache2_pld_done_int_ena : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_pld_done_int_ena:1;
        uint32_t reserved_3:1;
        /** l1_cache_pld_done_int_ena : R/W; bitpos: [4]; default: 0;
         *  The bit is used to enable interrupt of L1-Cache preload-operation. If preload
         *  operation is done, interrupt occurs.
         */
        uint32_t l1_cache_pld_done_int_ena:1;
        uint32_t reserved_5:1;
        /** sync_done_int_ena : R/W; bitpos: [6]; default: 0;
         *  The bit is used to enable interrupt of Cache sync-operation done.
         */
        uint32_t sync_done_int_ena:1;
        uint32_t reserved_7:2;
        /** l1_icache2_pld_err_int_ena : R/W; bitpos: [9]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_pld_err_int_ena:1;
        uint32_t reserved_10:1;
        /** l1_cache_pld_err_int_ena : R/W; bitpos: [11]; default: 0;
         *  The bit is used to enable interrupt of L1-Cache preload-operation error.
         */
        uint32_t l1_cache_pld_err_int_ena:1;
        uint32_t reserved_12:1;
        /** sync_err_int_ena : R/W; bitpos: [13]; default: 0;
         *  The bit is used to enable interrupt of Cache sync-operation error.
         */
        uint32_t sync_err_int_ena:1;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} cache_l1_cache_sync_preload_int_ena_reg_t;

/** Type of l1_cache_sync_preload_int_clr register
 *  Sync Preload operation Interrupt clear register
 */
typedef union {
    struct {
        uint32_t reserved_0:2;
        /** l1_icache2_pld_done_int_clr : WT; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_pld_done_int_clr:1;
        uint32_t reserved_3:1;
        /** l1_cache_pld_done_int_clr : WT; bitpos: [4]; default: 0;
         *  The bit is used to clear interrupt that occurs only when L1-Cache preload-operation
         *  is done.
         */
        uint32_t l1_cache_pld_done_int_clr:1;
        uint32_t reserved_5:1;
        /** sync_done_int_clr : WT; bitpos: [6]; default: 0;
         *  The bit is used to clear interrupt that occurs only when Cache sync-operation is
         *  done.
         */
        uint32_t sync_done_int_clr:1;
        uint32_t reserved_7:2;
        /** l1_icache2_pld_err_int_clr : WT; bitpos: [9]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_pld_err_int_clr:1;
        uint32_t reserved_10:1;
        /** l1_cache_pld_err_int_clr : WT; bitpos: [11]; default: 0;
         *  The bit is used to clear interrupt of L1-Cache preload-operation error.
         */
        uint32_t l1_cache_pld_err_int_clr:1;
        uint32_t reserved_12:1;
        /** sync_err_int_clr : WT; bitpos: [13]; default: 0;
         *  The bit is used to clear interrupt of Cache sync-operation error.
         */
        uint32_t sync_err_int_clr:1;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} cache_l1_cache_sync_preload_int_clr_reg_t;

/** Type of l1_cache_sync_preload_int_raw register
 *  Sync Preload operation Interrupt raw register
 */
typedef union {
    struct {
        uint32_t reserved_0:2;
        /** l1_icache2_pld_done_int_raw : R/WTC/SS; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_pld_done_int_raw:1;
        uint32_t reserved_3:1;
        /** l1_cache_pld_done_int_raw : R/WTC/SS; bitpos: [4]; default: 0;
         *  The raw bit of the interrupt that occurs only when L1-Cache preload-operation is
         *  done.
         */
        uint32_t l1_cache_pld_done_int_raw:1;
        uint32_t reserved_5:1;
        /** sync_done_int_raw : R/WTC/SS; bitpos: [6]; default: 0;
         *  The raw bit of the interrupt that occurs only when Cache sync-operation is done.
         */
        uint32_t sync_done_int_raw:1;
        uint32_t reserved_7:2;
        /** l1_icache2_pld_err_int_raw : R/WTC/SS; bitpos: [9]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_pld_err_int_raw:1;
        uint32_t reserved_10:1;
        /** l1_cache_pld_err_int_raw : R/WTC/SS; bitpos: [11]; default: 0;
         *  The raw bit of the interrupt that occurs only when L1-Cache preload-operation error
         *  occurs.
         */
        uint32_t l1_cache_pld_err_int_raw:1;
        uint32_t reserved_12:1;
        /** sync_err_int_raw : R/WTC/SS; bitpos: [13]; default: 0;
         *  The raw bit of the interrupt that occurs only when Cache sync-operation error
         *  occurs.
         */
        uint32_t sync_err_int_raw:1;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} cache_l1_cache_sync_preload_int_raw_reg_t;

/** Type of l1_cache_sync_preload_int_st register
 *  L1-Cache Access Fail Interrupt status register
 */
typedef union {
    struct {
        uint32_t reserved_0:2;
        /** l1_icache2_pld_done_int_st : RO; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_pld_done_int_st:1;
        uint32_t reserved_3:1;
        /** l1_cache_pld_done_int_st : RO; bitpos: [4]; default: 0;
         *  The bit indicates the status of the interrupt that occurs only when L1-Cache
         *  preload-operation is done.
         */
        uint32_t l1_cache_pld_done_int_st:1;
        uint32_t reserved_5:1;
        /** sync_done_int_st : RO; bitpos: [6]; default: 0;
         *  The bit indicates the status of the interrupt that occurs only when Cache
         *  sync-operation is done.
         */
        uint32_t sync_done_int_st:1;
        uint32_t reserved_7:2;
        /** l1_icache2_pld_err_int_st : RO; bitpos: [9]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_pld_err_int_st:1;
        uint32_t reserved_10:1;
        /** l1_cache_pld_err_int_st : RO; bitpos: [11]; default: 0;
         *  The bit indicates the status of the interrupt of L1-Cache preload-operation error.
         */
        uint32_t l1_cache_pld_err_int_st:1;
        uint32_t reserved_12:1;
        /** sync_err_int_st : RO; bitpos: [13]; default: 0;
         *  The bit indicates the status of the interrupt of Cache sync-operation error.
         */
        uint32_t sync_err_int_st:1;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} cache_l1_cache_sync_preload_int_st_reg_t;


/** Group: Cache Access Fail Configuration register */
/** Type of l1_cache_acs_fail_ctrl register
 *  Cache Access Fail Configuration register
 */
typedef union {
    struct {
        uint32_t reserved_0:2;
        /** l1_icache2_acs_fail_check_mode : R/W; bitpos: [2]; default: 0;
         *  The bit is used to configure l1 icache2 access fail check mode. 0: the access fail
         *  is not propagated to the request, 1: the access fail is propagated to the request
         */
        uint32_t l1_icache2_acs_fail_check_mode:1;
        uint32_t reserved_3:1;
        /** l1_cache_acs_fail_check_mode : R/W; bitpos: [4]; default: 0;
         *  The bit is used to configure l1 cache access fail check mode. 0: the access fail is
         *  not propagated to the request, 1: the access fail is propagated to the request
         */
        uint32_t l1_cache_acs_fail_check_mode:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} cache_l1_cache_acs_fail_ctrl_reg_t;


/** Group: Access Statistics registers */
/** Type of l1_cache_acs_cnt_ctrl register
 *  Cache Access Counter enable and clear register
 */
typedef union {
    struct {
        uint32_t reserved_0:2;
        /** l1_ibus2_cnt_ena : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t l1_ibus2_cnt_ena:1;
        /** l1_ibus3_cnt_ena : R/W; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t l1_ibus3_cnt_ena:1;
        /** l1_bus0_cnt_ena : R/W; bitpos: [4]; default: 0;
         *  The bit is used to enable dbus0 counter in L1-DCache.
         */
        uint32_t l1_bus0_cnt_ena:1;
        /** l1_bus1_cnt_ena : R/W; bitpos: [5]; default: 0;
         *  The bit is used to enable dbus1 counter in L1-DCache.
         */
        uint32_t l1_bus1_cnt_ena:1;
        uint32_t reserved_6:12;
        /** l1_ibus2_cnt_clr : WT; bitpos: [18]; default: 0;
         *  Reserved
         */
        uint32_t l1_ibus2_cnt_clr:1;
        /** l1_ibus3_cnt_clr : WT; bitpos: [19]; default: 0;
         *  Reserved
         */
        uint32_t l1_ibus3_cnt_clr:1;
        /** l1_bus0_cnt_clr : WT; bitpos: [20]; default: 0;
         *  The bit is used to clear dbus0 counter in L1-DCache.
         */
        uint32_t l1_bus0_cnt_clr:1;
        /** l1_bus1_cnt_clr : WT; bitpos: [21]; default: 0;
         *  The bit is used to clear dbus1 counter in L1-DCache.
         */
        uint32_t l1_bus1_cnt_clr:1;
        uint32_t reserved_22:10;
    };
    uint32_t val;
} cache_l1_cache_acs_cnt_ctrl_reg_t;

